tutorials/Oldroyd-B-LCR/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
From:
L.M. Quinzani, R.C. Amstrong, R.A. Brown, Birefringence and laser-Doppler velocimetry (LDV) studies of
viscoelastic flow through a planar contraction, J. Non-Newtonian Fluid Mech. 52 (1994) 1-36.

5.0 wt.% solution of polyisobutylene in tetradecane

Model        lambda   etaS    etaP
Oldroyd-B     0.06     0.002   1.424

*/

type Oldroyd-B-LCR;
rho              [1 -3 0 0 0 0 0] 803.87097;
etaS             [1 -1 -1 0 0 0 0] 0.002;
etaP             [1 -1 -1 0 0 0 0] 1.424;
lambda           [0 0 1 0 0 0 0] 0.06;


// ************************************************************************* //
