tutorials/Oldroyd-B-LCR/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner GAMG;
            tolerance 1e-7;
            relTol 0;
            smoother DICGaussSeidel;
            nPreSweeps 0;
            nPostSweeps 2;
            nFinestSweeps 2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 100;
            agglomerator faceAreaPair;
            mergeLevels 2;
        }
        tolerance 1e-7;
        relTol 0;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;

        tolerance        1e-6;
        relTol           0;
        minIter          0;
        maxIter          1000;
    }

    Psi
    {

        solver           PBiCGStab;
        preconditioner   DILU;

        tolerance        1e-6;
        relTol           0;
        minIter          0;
        maxIter          1000;

    }

}

PISO
{
    nCorrectors    2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p               0.3;
    U               0.5;
    Psi             0.3;
}


// ************************************************************************* //
